{
  "documents": [
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Область применения",
      "text_entities": [
        {
          "type": "plain",
          "text": "Настоящий стандарт устанавливает методы испытаний новых и восстановленных авиационных шин (далее — шины), применяемых на гражданских самолетах. Шины подразделяются на две группы: - низкоскоростные — эксплуатируемые при наземных скоростях до 192 км/ч включительно; - высокоскоростные — эксплуатируемые при наземных скоростях более 192 км/ч."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Подготовка шин к испытаниям (обкатка)",
      "text_entities": [
        {
          "type": "plain",
          "text": "Перед обкаткой шину монтируют на измерительный обод, накачивают до номинального внутреннего давления и выдерживают в течение 24 ч при температуре окружающего воздуха от 16 °C до 32 °C."
        },
        {
          "type": "plain",
          "text": "После выдержки шины в течение 24 ч внутреннее давление доводят до номинального внутреннего давления. Измерение проводят манометром с погрешностью измерения 1%. Все испытания должны проводиться при температуре окружающего воздуха от 16 °С до 32 °С."
        },
        {
          "type": "plain",
          "text": "Предварительная подготовка шины к испытаниям (обкатка) — статический метод: заключается в обжатии шины с номинальным внутренним давлением вертикальной нагрузкой на плоскую жесткую опору до прогиба шины, составляющего не менее 50 % полного прогиба, с последующим снятием нагрузки. Испытание проводят поочередно в четырех участках по окружности шины, каждый из которых находится под углом 90° относительно другого."
        },
        {
          "type": "plain",
          "text": "Предварительная подготовка шины к испытаниям (обкатка) — динамический метод: Шину с номинальным внутренним давлением и номинальной нагрузкой подвергают двойному испытанию в режиме «рулежка». Качение в режиме «рулежка» проводят при скорости 10 км/ч на расстояние 3,2 км. Испытания можно проводить как на динамическом стенде барабанного типа (динамометре), так и на стенде с плоской испытательной дорожкой. Перед началом второго испытания шину охлаждают до температуры окружающего воздуха."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Статические испытания",
      "text_entities": [
        {
          "type": "plain",
          "text": "Испытания на прочность внутренним гидравлическим давлением: Шину монтируют на испытательное колесо соответствующей прочности, накачивают водой до минимального контрольно-разрушающего давления. Шина должна выдержать это давление в течение 3 с без разрушений, после чего следует продолжить накачивать шину водой до разрыва. В процессе подкачивания скорость изменения давления должна быть минимальной (2 кгс/см² в минуту)."
        },
        {
          "type": "plain",
          "text": "Определение давления посадки шины на обод: За давление посадки шины на обод принимают минимальное внутреннее давление в шине, при котором достигается полное прилегание бортов шины к вертикальной поверхности реборды обода. Приняты два метода определения: копировальный метод и электрический метод. Можно использовать другие методы, если они признаны и одобрены организацией по сертификации. Во всех методах не следует использовать смазку борта шины или реборды колеса."
        },
        {
          "type": "plain",
          "text": "Определение герметичности бескамерных шин: После предварительной выдержки в течение не менее 12 ч при номинальном внутреннем давлении шину выдерживают 24 ч при той же температуре окружающего воздуха. Падение давления в шине за 24 ч не должно превышать 5 %."
        },
        {
          "type": "plain",
          "text": "Определение размеров шин: Шину монтируют на соответствующее колесо, накачивают до максимального номинального давления и выдерживают в течение 12 ч при комнатной температуре. По истечении этого времени доводят внутреннее давление в шине до первоначального значения, затем измеряют и регистрируют наружный диаметр, наружную ширину профиля, диаметр по плечевой зоне и ширину по плечевой зоне."
        },
        {
          "type": "plain",
          "text": "Определение зависимости «нагрузка — деформация»: Монтируют и подкачивают шину. Устанавливают смонтированную шину на испытательный стенд, при этом обеспечивают отсутствие зазоров между колесом, осью, втулками и т. д. для точного определения точки нулевой нагрузки."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Стендовые динамические испытания",
      "text_entities": [
        {
          "type": "plain",
          "text": "Общие положения: Шины испытывают одним из следующих методов: - низкоскоростные — в соответствии с 6.3 или как описано для высокоскоростных шин в 6.5; - высокоскоростные — в соответствии с 6.4 или 6.5."
        },
        {
          "type": "plain",
          "text": "Температура и интервал между испытаниями шины: Время между прижатиями шины к испытательному барабану должно быть выбрано таким образом, чтобы температура газа, содержащегося в шине, или температура каркаса в самой горячей точке шины перед прижатием в 90 % циклов составляла 41 °C. В остальных 10 % циклов температура газа в шине или каркаса перед прижатием должна быть не менее 27 °C."
        },
        {
          "type": "plain",
          "text": "Корректировка внутреннего давления в шине: При проведении испытания для учета влияния кривизны испытательного барабана внутреннее давление в шине корректируют в соответствии с одной из следующих рекомендаций: a) при обжатии шины на барабан номинальной нагрузкой подбирают внутреннее давление, обеспечивающее прогиб шины, соответствующий ее прогибу при нахождении на плоской поверхности с номинальным давлением под действием номинальной нагрузки; b) корректируют внутреннее давление, используя коэффициент пересчета."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Динамические испытания низкоскоростной шины",
      "text_entities": [
        {
          "type": "plain",
          "text": "Шину испытывают на стенде, имеющем кинетическую энергию Ek = 485Lr, где Lr — номинальная нагрузка на шину, кгс, при окружной скорости испытательного барабана 192 км/ч (104 узла)."
        },
        {
          "type": "plain",
          "text": "Во всех циклах испытания шина должна прижиматься к барабану с номинальной нагрузкой."
        },
        {
          "type": "plain",
          "text": "Шина должна выдерживать 200 циклов прижатий к испытательному барабану. Общее количество циклов стендовых испытаний делят на две равные части: a) в первой серии из 100 циклов шина должна поглотить за каждый цикл 56 % расчетной кинетической энергии Ek. Для обеспечения этого условия шина должна нагружаться при скорости 144 км/ч (78 узлов) и разгружаться при нулевой скорости; b) во второй серии циклов шина должна поглотить 44 % расчетной кинетической энергии Ek. Для обеспечения этого условия шина должна нагружаться при скорости 192 км/ч (104 узла) и разгружаться при скорости 144 км/ч (78 узлов)."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Динамические испытания высокоскоростной шины",
      "text_entities": [
        {
          "type": "plain",
          "text": "Испытание должно реально имитировать работу шины для самых критических комбинаций веса самолета и положения центра тяжести для всего цикла полета: от руления перед взлетом до руления после посадки."
        },
        {
          "type": "plain",
          "text": "При определении последовательности испытания необходимо учитывать: a) увеличение скорости и расстояния, исходя из условий работы в аэропортах, расположенных в горных районах; b) увеличение скорости и расстояния, исходя из условий работы при высокой температуре окружающего воздуха; c) нагревание или охлаждение в полете; d) увеличение расстояния в результате уменьшения ускорения, необходимого для работы самолета."
        },
        {
          "type": "plain",
          "text": "Характерные зависимости нагрузки/скорости/времени/расстояния, представленные изготовителем самолета, должны являться основой для определения условий испытаний."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Динамические испытания по условным зависимостям нагрузки/скорости/времени/расстояния",
      "text_entities": [
        {
          "type": "plain",
          "text": "Этот метод динамических испытаний применяют, если изменения нагрузки и скорости в зависимости от времени и расстояния определены разработчиком самолета не в форме полного типового испытательного цикла. На квалификационные испытания представляют одну шину."
        },
        {
          "type": "plain",
          "text": "Шины должны выдерживать динамические испытания в объеме 61 цикла, включающего 50 циклов «условного взлета», 8 циклов «рулежки» при номинальной нагрузке, 2 цикла «рулежки» с нагрузкой, равной 1,2 номинальной, и одного цикла «взлет с перегрузкой»; в момент прижатия нагрузка на шину должна быть в 1,5 раза выше номинальной."
        },
        {
          "type": "plain",
          "text": "50 циклов условного взлета должны имитировать фактические условия разбега самолета на взлетной полосе при наиболее критических значениях веса и скорости самолета, а также положении центра тяжести при взлете. Необходимо также учитывать увеличение скоростей при работе в аэропортах, расположенных в горных районах, и при высоких температурах окружающего воздуха."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 3324-2—2009. Авиационные шины и ободья. Часть 2. МЕТОДЫ ИСПЫТАНИЙ ШИН",
      "doc_chapter": "Испытательные скорости на стенде",
      "text_entities": [
        {
          "type": "plain",
          "text": "Допустимые испытательные скорости на стенде для соответствующих максимальных наземных скоростей приведены в таблице 2: 0-192 км/ч → 192 км/ч; 192-259 км/ч → 259 км/ч; 259-306 км/ч → 306 км/ч; 306-339 км/ч → 339 км/ч; 339-361 км/ч → 361 км/ч; 361-378 км/ч → 378 км/ч; 378-394 км/ч → 394 км/ч; свыше 394 км/ч → необходима консультация с изготовителем шин."
        }
      ]
    }
  ]
}