{
  "documents": [
    {
      "doc_name": "ГОСТ Р 53541—2009. ДВИГАТЕЛИ АВИАЦИОННЫЕ И ИХ УЗЛЫ. Индексация параметров состояния воздуха (газа) по сечениям проточной части авиационных двигателей и связанных с ними газовоздушных систем",
      "doc_chapter": "Область применения",
      "text_entities": [
        {
          "type": "plain",
          "text": "Настоящий стандарт устанавливает требования к системе нумерации контрольных сечений (СНКС), а также дополнительных сечений проточной части авиационных двигателей и их подсистем, связанных с отбором воздуха на нужды летательного аппарата и непосредственно двигателя."
        },
        {
          "type": "plain",
          "text": "Требования настоящего стандарта распространяются на применение СНКС при выполнении газодинамических расчетов, связанных с функционированием авиационных двигателей, в компьютерных программах, при проектировании и обработке данных по двигателю, в документации всех видов, научно-технической, учебной и справочной литературе."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 53541—2009. ДВИГАТЕЛИ АВИАЦИОННЫЕ И ИХ УЗЛЫ. Индексация параметров состояния воздуха (газа) по сечениям проточной части авиационных двигателей и связанных с ними газовоздушных систем",
      "doc_chapter": "Обозначения и сокращения",
      "text_entities": [
        {
          "type": "plain",
          "text": "В настоящем стандарте применены следующие обозначения и сокращения: ВРД — воздушно-реактивный двигатель; ГТД — газотурбинный двигатель; КВД — компрессор высокого давления; КНД — компрессор низкого давления; КС — камера сгорания; ЛА — летательный аппарат; СНКС — система нумерации контрольных сечений; ТРДФ — турбореактивный двигатель с форсажной камерой; ТРД — турбореактивный одноконтурный двигатель; ТВД — турбовинтовой двигатель; ТВВД — турбореактивный винтовентиляторный двигатель; ТРДДФ — турбореактивный двухконтурный двигатель с форсажной камерой; ТРТДФ — турбореактивный трехконтурный двигатель с форсажной камерой; ТРДД — турбореактивный двухконтурный двигатель; ФК — форсажная камера."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 53541—2009. ДВИГАТЕЛИ АВИАЦИОННЫЕ И ИХ УЗЛЫ. Индексация параметров состояния воздуха (газа) по сечениям проточной части авиационных двигателей и связанных с ними газовоздушных систем",
      "doc_chapter": "Принцип построения СНКС",
      "text_entities": [
        {
          "type": "plain",
          "text": "СНКС двигателя служит для обозначения последовательности процессов, которым подвергаются воздушно-газовые потоки в авиационном двигателе независимо от типа его цикличности."
        },
        {
          "type": "plain",
          "text": "СНКС двигателя строится на базе шести основных процессов, проходящих в одноконтурном газотурбинном двигателе с регулируемым соплом и форсажной камерой: - кинетическое сжатие потока, происходящее на входе в двигатель в комплексе воздухозаборник/диффузор; - механическое сжатие потока, происходящее в комплексе винтовентилятор/КВД (сжатие потока); - ввод тепла (камера сгорания/форсажная камера); - механическое расширение (расширение потока); - смешение (смеситель/эжектор); - расширение в сопловой части двигателя (сопло)."
        },
        {
          "type": "plain",
          "text": "Нумерация контрольных сечений для идентификации превращений основного воздушно-газового потока, проходящего через газотурбинный двигатель: До входа в воздухозаборник двигателя — 0; На входе в воздухозаборник двигателя — 1; На входе в двигатель — перед вентилятором: перед КНД — 2; За компрессором — на входе в камеру сгорания — 3; За камерой сгорания — на входе в турбину — 4; На I ступени турбины — «горло» соплового аппарата — 4.1; За турбиной — 5; Перед форсажной камерой — в смесителе — 6; На входе в сопло — 7; В горловине сопла — 8; На срезе сопла — 9."
        },
        {
          "type": "plain",
          "text": "В качестве базовой схемы с принятой системой нумерации сечений выбрана схема на основе турбореактивного одноконтурного двигателя с форсажной камерой и регулируемым соплом, в которой учтены все основные превращения воздушно-газового потока."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 53541—2009. ДВИГАТЕЛИ АВИАЦИОННЫЕ И ИХ УЗЛЫ. Индексация параметров состояния воздуха (газа) по сечениям проточной части авиационных двигателей и связанных с ними газовоздушных систем",
      "doc_chapter": "Примеры применения СНКС для различных типов двигателей",
      "text_entities": [
        {
          "type": "plain",
          "text": "Одноконтурный ТРДФ: Сечения обозначаются однозначными цифрами от единицы (1) до девяти (9) по ходу основного тракта газовоздушного потока двигателя. Если тот или иной процесс в двигателе отсутствует, то номер сечения для данного процесса изымается с сохранением всех номеров оставшихся сечений на своих местах."
        },
        {
          "type": "plain",
          "text": "ТРДДФ с форсажной камерой во втором контуре и со смешением контуров: Для распространения нумерации сечений с основного, первого контура (I) на второй контур (II) слева от номеров сечений контура I проставляют цифру один (1). Двузначная нумерация сечений по контуру II продолжается вплоть до среза сопла этого контура, если нет смешения потоков в контурах I и II. Если существуют смешение и общее сопло, то нумерация сечений по общему соплу проставляется по нумерации сопла контура I цифрами 7, 8 и 9."
        },
        {
          "type": "plain",
          "text": "Для обозначения промежуточных (дополнительных) сечений потоков, расположенных на участках основных процессов двигателя, вводится знак подразделителя (« : »). При этом в цикле на участке сжатия 2—3 сечению присваивается номер начала процесса, а после подразделителя идет номер дополнительного сечения на данном участке цикла, возрастающий по потоку (2 : 1, 2 : 2 и т. д.)."
        },
        {
          "type": "plain",
          "text": "ТРТДФ с форсажной камерой в контуре II и без смешения контуров: Распространение схемы нумерации с основного контура двигателя I на контур III производят путем добавления цифры два (2) слева от основной цифры."
        },
        {
          "type": "plain",
          "text": "СНКС винтовентиляторов: Винтовентиляторные группы работают во внешнем, обтекающем двигатель потоке, к номерам сечений справа добавляется любая буква, например «Р». Контрольные сечения для винтовентиляторной группы: На входе в винтовентиляторную группу — для внутренней части потока — 1P; для внешней части потока — 11P; На выходе из винтовентиляторной группы — для внутренней части потока — 3P; для внешней части потока — 13P; Между рабочими ступенями винтовентиляторной группы — для внутренней части потока — 2×P; для внешней части потока — 12×P; На входе в КНД двигателя — 2."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 53541—2009. ДВИГАТЕЛИ АВИАЦИОННЫЕ И ИХ УЗЛЫ. Индексация параметров состояния воздуха (газа) по сечениям проточной части авиационных двигателей и связанных с ними газовоздушных систем",
      "doc_chapter": "Нумерация сечений индивидуальных потоков",
      "text_entities": [
        {
          "type": "plain",
          "text": "Нумерация сечений индивидуальных потоков (контуров), являющихся неконцентрическими относительно основного контура двигателя, основана на использовании СНКС для систем отбора, перепуска, регенерации тепла и т. д. с учетом направлений основного и концентрических относительно него газовоздушных потоков."
        },
        {
          "type": "plain",
          "text": "Основополагающими являются цифры в скобках (9); (8); ...; (3); (2); (1), обозначающие тот или иной контур газовоздушного потока, являющегося неконцентрическим относительно потока основного контура. Далее проставляются номера сечений для процессов, происходящих в индивидуальном контуре."
        },
        {
          "type": "plain",
          "text": "Пример: Для отбора воздуха из контура II за вентилятором контрольные сечения обозначены как (9)17 и (9)19. Нумерация сечений для отбора воздуха на нужды двигателя и ЛА: На нужды ЛА — из контура II — (9)17: (9)19; За компрессором ВД — (8)7: (8)9; Линия постоянного отбора — (7)7: (7)9; Линия переменного отбора — (6)7: (6)9; Линия подвода и регенерации тепла в контуре II — (5)7: (5)9; Системы перепуска между ступенями КВД — (4)7: (4)9; Перед теплообменником — 13 : 4; В смесителе (за теплообменником) — 14."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 53541—2009. ДВИГАТЕЛИ АВИАЦИОННЫЕ И ИХ УЗЛЫ. Индексация параметров состояния воздуха (газа) по сечениям проточной части авиационных двигателей и связанных с ними газовоздушных систем",
      "doc_chapter": "Обозначение и индексация параметров воздушно-газового потока",
      "text_entities": [
        {
          "type": "plain",
          "text": "В настоящее время для обозначения параметров состояния воздушно-газового потока в авиационных ГТД используют в основном буквенные индексы. Термины, параметры и обозначения основных элементов конструкции ГТД приняты по ГОСТ 23851 и ГОСТ 23199."
        },
        {
          "type": "plain",
          "text": "Примеры обозначений параметров по старой и новой системам: В невозмущенном потоке — наружной среде, Н: старая система — P_H, T_H; новая система — P_0, T_0. На входе в двигатель — за входным устройством перед вентилятором или компрессором, ВХ: старая система — T_ВХ; новая система — T_2. За компрессором, К: старая система — T_K; новая система — T_3. За камерой сгорания, при выходе из камеры сгорания, Г: старая система — T_Г; новая система — T_4. За турбиной, Т: старая система — T_Т; новая система — T_5. При выходе из сопла, С: старая система — P_C*, T_C*; новая система — P_9*, T_9*."
        },
        {
          "type": "plain",
          "text": "Система нумерации контрольных сечений не отменяет существующую систему обозначений и может быть вначале использована совместно с существующей."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 53541—2009. ДВИГАТЕЛИ АВИАЦИОННЫЕ И ИХ УЗЛЫ. Индексация параметров состояния воздуха (газа) по сечениям проточной части авиационных двигателей и связанных с ними газовоздушных систем",
      "doc_chapter": "Система нумерации контрольных сечений в поршневых авиационных двигателях",
      "text_entities": [
        {
          "type": "plain",
          "text": "Система нумерации контрольных сечений может быть применена и для поршневых авиационных двигателей. Вариант такого применения носит рекомендательный характер."
        },
        {
          "type": "plain",
          "text": "В соответствии с основными процессами, протекающими в поршневом двигателе, и соответствующую им нумерацию контрольных сечений можно представить следующим образом: - кинетическое сжатие потока на входе в двигатель — до сечения 2К; - предварительное механическое сжатие потока (при наличии нагнетателя) — сечения 2К, 3К; - механическое сжатие газовоздушной смеси в цилиндре — сечения 2, 3; - ввод тепла — сечения 3, 4; - механическое расширение смеси — сечения 4, 5; - расширение в выхлопной системе — сечения 7, 9."
        },
        {
          "type": "plain",
          "text": "Контрольные сечения обозначаются однозначными цифрами по направлению основного тракта воздушного и газового потоков в соответствии с выбранной базовой схемой. Если тот или иной процесс в двигателе и его входной и выхлопной системах отсутствует, то номера сечений данного процесса опускаются с сохранением всех номеров оставшихся сечений."
        }
      ]
    }
  ]
}