{
  "documents": [
    {
      "doc_name": "ГОСТ Р 59007—2020. Авиационная техника. СТАНЦИЯ МАСЛОНАСОСНАЯ. Основные параметры и технические требования",
      "doc_chapter": "Область применения",
      "text_entities": [
        {
          "type": "plain",
          "text": "Настоящий стандарт распространяется на маслонасосные станции, предназначенные для снабжения силовых цилиндров и исполнительных органов управляющих систем рабочей жидкостью со стабилизированным давлением, с регулируемым расходом, заданными температурой и чистотой. Стандарт устанавливает требования для маслонасосных станций, используемых как при прочностных статических и ресурсных испытаниях авиационных конструкций и их элементов, так и при проверке функционирования и настройке устройств нагружения."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 59007—2020. Авиационная техника. СТАНЦИЯ МАСЛОНАСОСНАЯ. Основные параметры и технические требования",
      "doc_chapter": "Основные положения и общие требования",
      "text_entities": [
        {
          "type": "plain",
          "text": "Испытания планеров самолетов и их агрегатов проводят на специальных стендах, в состав которых входят маслонасосные станции. Станции включают в себя гидравлические объемные насосы, расходный бак, трубопроводы, гидроаппаратуру, системы фильтрации, нагрева и охлаждения рабочей жидкости, электроснабжения и автоматизации, узел предохранительных клапанов и др."
        },
        {
          "type": "plain",
          "text": "Конструктивное исполнение маслонасосной станции должно обеспечить заданные параметры по расходу, давлению, температуре и чистоте рабочей жидкости, питающей силовые гидравлические цилиндры как при прочностных статических и ресурсных испытаниях, так и при проверке функционирования и настройке устройств нагружения."
        },
        {
          "type": "plain",
          "text": "В процессе проектирования гидроприводов, гидросистем и гидроустройств должны быть предусмотрены средства защиты обслуживающего персонала от возможного воздействия опасных вредных факторов по ГОСТ 12.2.003 и также соблюдены требования пожарной безопасности по ГОСТ 12.1.004, электробезопасности по ГОСТ 12.1.019."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 59007—2020. Авиационная техника. СТАНЦИЯ МАСЛОНАСОСНАЯ. Основные параметры и технические требования",
      "doc_chapter": "Технические требования к гидравлической системе",
      "text_entities": [
        {
          "type": "plain",
          "text": "В качестве рабочей жидкости (РЖ) в маслонасосной станции следует применять высокоочищенные минеральные масла с присадками, улучшающими антиокислительные, противомэносные и противокоррозионные свойства масла, имеющие кинематическую вязкость 40—47 мм²/с (сСт) при температуре 40 °C (104 °F)."
        },
        {
          "type": "plain",
          "text": "Чистота рабочей жидкости в сливной линии гидросистемы должна быть не менее 8-го класса по ГОСТ 17216. Тонкость фильтрации на линии нагнетания 5 мкм, слива — 10 мкм."
        },
        {
          "type": "plain",
          "text": "Давление (номинальное): 17–32 МПа. Давление управления: 5–7 МПа. Давление подпитки: 0,5–1,5 МПа. Промежуточное давление: 5–16 МПа."
        },
        {
          "type": "plain",
          "text": "Температура рабочей жидкости на выходе из маслонасосной станции: 45 ± 2,5 °C. Температура окружающей среды: минимальная 5 °C, максимальная 35 °C."
        },
        {
          "type": "plain",
          "text": "Расходный бак должен быть оборудован воздушными фильтрами с тонкостью фильтрации не хуже 10 мкм, съемными крышками для осмотра и очистки. Емкость бака рассчитывают из условия номинальной подачи."
        },
        {
          "type": "plain",
          "text": "Насосы должны иметь динамические характеристики: погрешность поддержания заданного давления не более 3,5 %, время регулирования при скачкообразном изменении подачи от нуля до максимума при 32 МПа не более 0,15 с; время регулирования при скачкообразном изменении подачи от максимума до нуля при 32 МПа не более 0,13 с; диапазон регулирования давления от 3,5 МПа до 32 МПа."
        },
        {
          "type": "plain",
          "text": "Должна быть предусмотрена установка резервных насосов, мощность которых составляет 15 % – 20 % от номинальной суммарной мощности станции."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 59007—2020. Авиационная техника. СТАНЦИЯ МАСЛОНАСОСНАЯ. Основные параметры и технические требования",
      "doc_chapter": "Температурный контроль и безопасность гидросистемы",
      "text_entities": [
        {
          "type": "plain",
          "text": "Заданная температура рабочей жидкости должна поддерживаться системой стабилизации температуры. При повышении температуры рабочей жидкости до (50 ± 1) °С подается предупредительный сигнал, насосы переводятся в режим разгрузки (на режим холостого хода) и отключаются. Должна быть предусмотрена система нагрева рабочей жидкости в расходном баке."
        },
        {
          "type": "plain",
          "text": "На линии высокого давления должен быть установлен запорный клапан, перекрывающий подачу рабочей жидкости от станции к потребителям. В нижних и верхних точках линий высокого давления, всасывания и слива должны быть предусмотрены краны для слива рабочей жидкости и удаления воздуха в процессе обслуживания и ремонта."
        },
        {
          "type": "plain",
          "text": "В состав станции должна входить станция охлаждения и фильтрации РЖ. Охлаждающей жидкостью служит техническая водопроводная вода, отфильтрованная от частиц более 500 мкм, с температурой на входе в теплообменник не выше 20 °С. Тонкость фильтрации РЖ фильтра станции охлаждения — не более 6 мкм."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 59007—2020. Авиационная техника. СТАНЦИЯ МАСЛОНАСОСНАЯ. Основные параметры и технические требования",
      "doc_chapter": "Системы электроснабжения, управления, автоматизации и контроля",
      "text_entities": [
        {
          "type": "plain",
          "text": "Электроснабжение оборудования выполняется от трансформаторов, установленных на ГПП. Система управления, автоматизации и контроля должна быть построена с использованием программируемых промышленных логических контроллеров, систем сбора и обработки информации."
        },
        {
          "type": "plain",
          "text": "Пульт управления (автоматизированное рабочее место оператора) должен иметь технические средства, показывающие в символьной форме все имеющееся оборудование на маслонасосной станции, его состояние, режим работы, а также осуществляющие дистанционное управление оборудованием. Система управления станции должна иметь источник бесперебойного питания."
        },
        {
          "type": "plain",
          "text": "Маслонасосная станция должна быть оборудована МШУ (местный щит управления), позволяющим управлять насосами. На МШУ должны быть установлены переключатель, позволяющий выбирать местное или дистанционное управление, а также органы управления и индикации, необходимые для настройки и обслуживания станции."
        },
        {
          "type": "plain",
          "text": "Маслонасосная станция должна быть оборудована измерительными приборами, позволяющими контролировать: давление и расход в напорной линии; давления в напорных линиях насосов; давление в сливной линии; температуру корпусов основных насосов и насосов системы охлаждения; давление на выходе из насосов системы охлаждения; наработку насосов; температуру и уровень рабочей жидкости в баке; наличие воды в баке линии охлаждения; степень засорения фильтров; давление и температуру РЖ и воды на входе и выходе теплообменника; токи электродвигателей насосов высокого давления."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 59007—2020. Авиационная техника. СТАНЦИЯ МАСЛОНАСОСНАЯ. Основные параметры и технические требования",
      "doc_chapter": "Конструктивное исполнение и аварийные системы",
      "text_entities": [
        {
          "type": "plain",
          "text": "Маслонасосная станция должна размещаться в специальном помещении, а силовые шкафы должны размещаться в отдельном помещении (щитовой). Для уменьшения шума и вибрации насосы должны быть установлены на виброопорах, а всасывающие и напорные патрубки насосов связаны с трубопроводами с помощью гибких компенсаторов или рукавов высокого давления."
        },
        {
          "type": "plain",
          "text": "Сварные соединения поставляемого напорного коллектора должны быть проверены неразрушающим методом (рентгенографическим, ультразвуковым или подобным) на целостность и однородность. Баки и трубопроводы должны быть выполнены из коррозионно-стойкой стали."
        },
        {
          "type": "plain",
          "text": "Должна быть установлена система аварийного слива рабочей жидкости из станции в емкость, расположенную вне корпуса, в котором находится станция. Должна быть светозвуковая аварийная сигнализация технологических параметров при следующих ситуациях: обрыв фазы питающей сети насосов высокого давления; достижение минимального/максимального давления на насосах высокого давления; достижение максимального давления в сливной магистрали; достижение максимального перепада давления на установке фильтрации; достижение предельного значения текущего уровня РЖ в расходном баке; достижение максимального значения температуры РЖ в расходном баке; достижение максимального значения температуры РЖ после теплообменников."
        },
        {
          "type": "plain",
          "text": "Необходимо наличие кнопки «аварийное отключение» для критических ситуаций, возникающих в помещении станции маслонасосной. Место расположение кнопок: первая на ЦПУ на сенсорном экране компьютера, вторая в помещении машинного зала. Аварийные ситуации: возникновение пожара; нарушение герметичности гидросистемы (масляный туман, разлив РЖ); не сработало аварийное отключение систем, оборудования; сообщение оператора, ведущего испытание изделий."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р 59007—2020. Авиационная техника. СТАНЦИЯ МАСЛОНАСОСНАЯ. Основные параметры и технические требования",
      "doc_chapter": "Условия эксплуатации, пусконаладка и документация",
      "text_entities": [
        {
          "type": "plain",
          "text": "Режим работы — круглосуточный."
        },
        {
          "type": "plain",
          "text": "Методика пусконаладочных работ согласуется с заказчиком. Пусконаладочные работы проводятся поставщиком оборудования с привлечением персонала заказчика."
        },
        {
          "type": "plain",
          "text": "Маслонасосная станция поставляется со следующей документацией: технический паспорт; руководство по эксплуатации с принципиальной электрической и принципиальной гидравлической схемами; руководство по монтажу; паспорт и (или) руководства по эксплуатации на покупные комплектующие; перечень компонентов и запасных частей. Техническая документация предоставляется в бумажном виде в двух экземплярах, а также на электронном носителе (CD-ROM, флеш-карте) в двух экземплярах."
        }
      ]
    }
  ]
}