{
  "documents": [
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Область применения",
      "text_entities": [
        {
          "type": "plain",
          "text": "В настоящем стандарте установлены критерии проектирования для приводов агрегатов и монтажных фланцев, обеспечивающих возможности быстрого подсоединения или отсоединения, предназначенных в основном для использования в авиационных двигателях/редукторах и агрегатах двигателей.\n\nПримечание — Некоторые критерии проектирования подлежат согласованию между предприятием — изготовителем двигателей/редукторов и предприятием — изготовителем агрегатов."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Нормативные ссылки",
      "text_entities": [
        {
          "type": "plain",
          "text": "Следующие ниже нормативные стандарты содержат положения, которые посредством ссылок в данном тексте составляют положения настоящего стандарта. Для нормативных стандартов с указанием даты публикации, на которые имеются ссылки, не распространяется действие последующих изменений или пересмотров этих стандартов."
        },
        {
          "type": "plain",
          "text": "ИСО 3601-1:1988 Приводы гидравлические и пневматические. Уплотнительные элементы. Уплотнительные кольца. Часть 1. Внутренние диаметры, поперечные сечения, допуски и идентификационные коды размеров."
        },
        {
          "type": "plain",
          "text": "ИСО 4156:1981 Шлицы прямые с боковыми эвольвентными поверхностями для цилиндрических валов. Метрический модуль. Посадка по боковой поверхности. Общая информация, размеры и контроль."
        },
        {
          "type": "plain",
          "text": "ИСО 8399-2:1998 Авиация и космонавтика. Вспомогательные приводы и крепежные фланцы (Метрическая серия). Часть 2. Размеры."
        },
        {
          "type": "plain",
          "text": "ИСО 9214 Авиация и космонавтика. Хомуты V-образные для вспомогательных приводов и монтажных фланцев. Конструкция и размеры (в стадии рассмотрения)."
        },
        {
          "type": "plain",
          "text": "ИСО 13715:1994 Чертежи технические. Углы. Словарь и указания на чертежах."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Установка и снятие",
      "text_entities": [
        {
          "type": "plain",
          "text": "Для удобства монтажа агрегатов на двигателе длина валика шлицевого привода должна быть такой, чтобы шлицы входили в зацепление не менее чем на 5 мм до того, как соединительная трубка или установочный штифт войдут в отверстие соответствующих фланцев корпусов."
        },
        {
          "type": "plain",
          "text": "Монтаж (демонтаж) агрегатов следует проводить на двигателях/редукторах, установленных по месту эксплуатации."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Соединительные трубки и установочные штифты и/или валики крутящего момента",
      "text_entities": [
        {
          "type": "plain",
          "text": "Все соединительные трубки и установочные штифты должны быть предназначены для агрегатов. Предприятие — изготовитель агрегатов несет ответственность за метод фиксации и поставку соединительных трубок и установочных штифтов."
        },
        {
          "type": "plain",
          "text": "Соединительные трубки или установочные штифты не должны воспринимать крутящий момент. Использование соединительных трубок для обеспечения крутящего момента должно быть исключено. Воздействия от крутящего момента, гидравлического давления потока жидкости на соединительные трубки и установочные штифты должны быть минимальными."
        },
        {
          "type": "plain",
          "text": "Применение их в других устройствах должно быть согласовано между предприятием — изготовителем двигателей/редукторов и предприятием — изготовителем агрегатов."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Шлицевые приводы",
      "text_entities": [
        {
          "type": "plain",
          "text": "Агрегат должен приводиться в действие эвольвентным приводным шлицевым валиком. Размеры, предельные отклонения и расположения поверхностей, параметры шероховатостей должны соответствовать требованиям ИСО 4156 и ИСО 8399-2. Длина зубьев шлиц должна соответствовать требованиям ИСО 8399-2."
        },
        {
          "type": "plain",
          "text": "Агрегат имеет приводной вал с радиальным зазором."
        },
        {
          "type": "plain",
          "text": "Биение по профилям зубьев (шлиц) относительно центрирующей поверхности (диаметра) должно быть не более 0,15 мм."
        },
        {
          "type": "plain",
          "text": "Отклонение от перпендикулярности, вызванное максимальным смещением на 0,15 мм (в любом направлении) оси приводного вала по отношению к оси, определенной опорной поверхностью и центрирующей поверхностью, не должно превышать 3/100."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Уплотнение",
      "text_entities": [
        {
          "type": "plain",
          "text": "Для уплотнения соединительных трубок и центрирующей поверхности следует использовать уплотнительные кольца размерами, указанными в ИСО 3601-1. Размеры и материалы уплотнительных колец должны быть выбраны предприятием — изготовителем двигателей/редукторов."
        },
        {
          "type": "plain",
          "text": "В случае вероятности возникновения утечек масла из агрегатов в полость сопряжения утечка не должна превышать 2 см³/ч. При необходимости агрегат должен иметь средства дренажа полости двигателя или редуктора."
        },
        {
          "type": "plain",
          "text": "Утечки через уплотнения приводного вала в полость сопряжения не должны превышать 2 см³/ч."
        },
        {
          "type": "plain",
          "text": "Для агрегатов, отвечающих требованиям 8399, не предусмотрены восстановление или рециркуляция масла в случае чрезмерных утечек. Необходимость применения и использования дренажного устройства должна быть согласована между предприятием — изготовителем двигателей/редукторов и предприятием — изготовителем агрегатов."
        },
        {
          "type": "plain",
          "text": "Материалы уплотнительных устройств следует выбирать с учетом их работоспособности в рабочих жидкостях, применяемых в двигателях и коробках приводов."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Направление вращения вала (поворот вала)",
      "text_entities": [
        {
          "type": "plain",
          "text": "Направление вращения вала следует определять по направлению взгляда на опорную поверхность фланца агрегата, и направления вращения должны иметь следующие маркировки:\n- по часовой стрелке (CW);\n- против часовой стрелки (CCW)."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Вопросы, являющиеся предметом соглашения между предприятиями",
      "text_entities": [
        {
          "type": "plain",
          "text": "Предприятия — изготовители двигателей/редукторов и предприятия — изготовители агрегатов согласовывают между собой:\na) координаты установки и предельные отклонения формы и расположения поверхностей трубок передачи масла или установочных штифтов при установке нескольких трубок или штифтов на фланце агрегата;\nb) требования, связанные с передачей крутящего момента от других устройств;\nc) конструкцию и способы смазки шпицевого привода;\nd) метод предотвращения перегрузки привода;\ne) размещение полости сопряжения агрегата и привода."
        }
      ]
    },
    {
      "doc_name": "ГОСТ Р ИСО 8399-1—2010. АВИАЦИЯ И КОСМОНАВТИКА. Присоединения агрегатов к изделию. Вспомогательные приводы и монтажные фланцы (Метрическая серия). Часть 1. Критерии проектирования",
      "doc_chapter": "Обозначение",
      "text_entities": [
        {
          "type": "plain",
          "text": "Приводы агрегатов и монтажные фланцы следует обозначать группой опознавательных символов. Пример обозначения: ИСО 8399 A 062, где:\n- ИСО 8399 — номер стандарта;\n- A — код центра/рующего выступа (см. ИСО 8399-2);\n- 062 — номер кода шпица (см. ИСО 8399-2)."
        }
      ]
    }
  ]
}